In [2]:
import numpy as np

In [ ]:
array = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
print(array)

In [3]:
import pandas as pd

In [ ]:
inventory = {"Code" : [478, 467, 678], "Produce" : ["Avocado", "Courgette", "Potato"], "Origin" : ["Mexico", "Costa rica", "Bolivia"]}

myframe = pd.DataFrame(inventory)

print(inventory)
print(myframe)

In [ ]:
array_1 = np.arange(10)
array_1

array_true = np.bool_((3,3))
print(array_true)

In [ ]:
arr_1 = np.arange(1, 11)
arr_odd_nums = arr_1[::2]
arr_odd_nums[:] = -1
print(arr_1)

In [ ]:
array_1D = np.array([5,10,15,20,25,30,35,40,45])
array_2D = array_1D.reshape(3,3)
array_2D

In [ ]:
a = np.arange(1,7).reshape(2,3)
b = np.arange(11,17).reshape(3,2)
c = np.dot(a,b)
sum_ = np.sum(c) 
print(a)
print(b)
print(c)
print(sum_)

In [ ]:
zeros_array = np.zeros([3,3])
bool_arr = zeros_array < 1
print(bool_arr)

In [ ]:
zeros_array = np.zeros([3,3])
bool_arr = np.where(zeros_array<1,True,False)
print(bool_arr)

In [80]:
data_destinations

    Destinations  Score  Hotel rating  All inclusive hotels Most visited city
0          Japan      6           2.8                     7             Tokyo
1       Thailand      7           3.7                    12           Bangkok
2      Australia      4           2.3                     5            Sydney
3         France      5           2.8                     6             Paris
4        Morocco      9           4.8                    18         Marrakech
5         Brazil      5           2.5                     9    Rio de Janeiro
6          China      7           3.0                    10           Beijing
7   South Africa      4           2.4                     5      Johannesburg
8            USA      6           3.1                    14     New York City
9          Italy      3           2.9                     4              Rome
10         Spain      9           4.5                     8         Barcelona
11      Malaysia      7           3.6                     9      Kuala Lumpur
12        Cyprus      8           3.9                    13          Limassol
13        Canada      2           2.0                     7           Toronto
14        Greece      8           4.2                    11            Athens

In [79]:
data_destinations = pd.read_csv('My_Data.csv')
data_destinations.shape

(15, 5)

In [24]:
data_destinations.iloc[2:8]

   Destinations  Score  Hotel rating  All inclusive hotels Most visited city
2     Australia      4           2.3                     5            Sydney
3        France      5           2.8                     6             Paris
4       Morocco      9           4.8                    18         Marrakech
5        Brazil      5           2.5                     9    Rio de Janeiro
6         China      7           3.0                    10           Beijing
7  South Africa      4           2.4                     5      Johannesburg

In [41]:
data_destinations["All inclusive hotels"].mean()

9.2

In [81]:
data_destinations["Score"].min()
data_destinations["Score"] == 2
print(data_destinations.iloc[13])

Destinations             Canada
Score                         2
Hotel rating                2.0
All inclusive hotels          7
Most visited city       Toronto
Name: 13, dtype: object

In [82]:
data_destinations["Score"].max()
data_destinations["Score"] == 9
print(data_destinations.iloc[[4, 10], 0])

4     Morocco
10      Spain
Name: Destinations, dtype: object

In [70]:
data_destinations["All inclusive hotels"] > 9
data_destinations.iloc[[1, 4, 6, 8, 12, 14], [0, 3]]

   Destinations  All inclusive hotels
1      Thailand                    12
4       Morocco                    18
6         China                    10
8           USA                    14
12       Cyprus                    13
14       Greece                    11

In [75]:
data_destinations["Score"] > 8
data_destinations.iloc[[4, 10], [0, 1]]

   Destinations  Score
4       Morocco      9
10        Spain      9

In [78]:
data_destinations["Score"] <= 2
data_destinations.iloc[13, [0, 1]]

Destinations    Canada
Score                2
Name: 13, dtype: object

In [96]:
data_destinations[['Destinations', 'Score']]

    Destinations  Score
0          Japan      6
1       Thailand      7
2      Australia      4
3         France      5
4        Morocco      9
5         Brazil      5
6          China      7
7   South Africa      4
8            USA      6
9          Italy      3
10         Spain      9
11      Malaysia      7
12        Cyprus      8
13        Canada      2
14        Greece      8